src/cf/InformationRegisters/Share.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>Share</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВариантУдаления</Name>
					<Comment>0 - не удалять, 1 - Удалить после получения, 2 - удалить в указанную дату</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУдаления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/Share/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура Выполнитьдействие(Команда)
	Если Команда.Имя="" Тогда
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСсылку(Команда)
  	Объект=Новый COMОбъект("htmlfile");
    Объект.ParentWindow.ClipboardData.Setdata("Text", Ссылка);
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиПоСсылке(Команда)
	Записать(); НачатьЗапускПриложения(, "http://"+Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементовФормы()
	Элементы.ДатаУдаления.Видимость=Запись.ВариантУдаления=2;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов формы

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="ВариантУдаления" Тогда
		ВидимостьЭлементовФормы();
		
	ИначеЕсли Элемент.Имя="ФорматСсылки" Тогда
		Запись.Тип=ФорматСсылки;
	КонецЕсли; 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ТабличныйДокумент", ТабличныйДокумент);
	Если ТабличныйДокумент=Неопределено Тогда Отказ=Истина; Возврат; КонецЕсли;

	Элементы.ФорматСсылки.СписокВыбора.Добавить("HTML", "HTML",,БиблиотекаКартинок.ФорматHTML);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("XLSX", "XLSX",,БиблиотекаКартинок.ФорматExcel);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("PDF", "PDF",,БиблиотекаКартинок.ФорматPDF);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("ODS", "ODS",,БиблиотекаКартинок.ФорматWord);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("DOCX", "DOCX",,БиблиотекаКартинок.ФорматWord);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("HTML3", "HTML 3",,БиблиотекаКартинок.ФорматHTML);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("HTML4", "HTML 4",,БиблиотекаКартинок.ФорматHTML);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("HTML5", "HTML 5",,БиблиотекаКартинок.ФорматHTML);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("MXL", "MXL",,БиблиотекаКартинок.ФорматMXL);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("MXL7", "MXL 7",,БиблиотекаКартинок.ФорматMXL);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("ANSITXT", "ANSITXT",,БиблиотекаКартинок.ФорматTXT);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("TXT", "TXT",,БиблиотекаКартинок.ФорматTXT);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("XLS95", "XLS 95",,БиблиотекаКартинок.ФорматExcel);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("XLS97", "XLS 97",,БиблиотекаКартинок.ФорматExcel);

	ФорматСсылки="HTML";

	Запись.ID=Новый УникальныйИдентификатор;
	Запись.Автор=ПараметрыСеанса.ТекущийПользователь;
	Запись.Тип=ФорматСсылки;
	Запись.ВариантУдаления=1;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПараметрыПубликации=УправлениеКонфигурациейСервер.ПараметрыПубликацииИБ();
	Если НЕ ТипЗнч(ПараметрыПубликации)=Тип("Структура") Тогда
		ПоказатьПредупреждение(, "Не настроены параметры формирования ссылки!", 20, "Внимание");
		Отказ=Истина; Возврат;
	КонецЕсли;
	Ссылка=СокрЛП(ПараметрыПубликации.Сервер)+":"+СтрЗаменить(СокрЛП(ПараметрыПубликации.Порт), Символы.НПП, "")+"\"+СокрЛП(ПараметрыПубликации.База)+"\hs\Share\"+СокрЛП(Запись.ID);
	ВидимостьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	////стрФайл=ПолучитьИмяВременногоФайла(Запись.Тип);
	////ТабличныйДокумент.Записать(стрФайл, ТипФайлаТабличногоДокумента[Запись.Тип]);
	////ДвоичныеДанные=Новый ДвоичныеДанные(стрФайл);
	////ТекущийОбъект.Данные=Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));

	Поток=Новый ПотокВПамяти;
	ТабличныйДокумент.Записать(Поток, ТипФайлаТабличногоДокумента[Запись.Тип]);	
	ТекущийОбъект.Данные=Новый ХранилищеЗначения(Поток.ЗакрытьИПолучитьДвоичныеДанные(), Новый СжатиеДанных(9));	
КонецПроцедуры
